In [44]:
import pandas as pd
import numpy as np
df = pd.DataFrame({ 'A':1,
                    'B':pd.Timestamp('20180924', freq=6),
                    'C':np.array([3] * 4),
                    'D':pd.Categorical(['test', 'train', 'test', 'train']),
                    'F':'foo'
    
})
df

   A          B  C      D    F
0  1 2018-09-24  3   test  foo
1  1 2018-09-24  3  train  foo
2  1 2018-09-24  3   test  foo
3  1 2018-09-24  3  train  foo

In [45]:
df.dtypes

A             int64
B    datetime64[ns]
C             int32
D          category
F            object
dtype: object

In [5]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
df.columns

Index(['A', 'B', 'C', 'D', 'F'], dtype='object')

In [7]:
#Transposing the dataset
df.T

,0,1,2,3
A,1,1,1,1
B,2018-09-24 00:00:00,2018-09-24 00:00:00,2018-09-24 00:00:00,2018-09-24 00:00:00
C,3,3,3,3
D,test,train,test,train
F,foo,foo,foo,foo

In [8]:
df.sort_values(by='D')

   A          B  C      D    F
0  1 2018-09-24  3   test  foo
2  1 2018-09-24  3   test  foo
1  1 2018-09-24  3  train  foo
3  1 2018-09-24  3  train  foo

In [38]:
df2 = pd.read_csv(r"C:\Users\Kamal Dev Sharma\testdirec\sentdex practice\NSE-MARUTI.csv") #we use 'r' for raw string
df2.head()

,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,2018-08-17,9243.00,9286.50,9130.00,9149.95,9152.10,477538.0,44002.98
1,2018-08-16,9124.00,9235.95,9085.00,9202.20,9200.55,465479.0,42757.42
2,2018-08-14,9079.00,9158.80,9046.25,9135.00,9132.60,344056.0,31355.62
3,2018-08-13,9119.45,9185.00,9012.20,9107.00,9080.85,348201.0,31750.75
4,2018-08-10,9150.00,9210.00,9105.00,9119.90,9148.25,427827.0,39190.31

In [10]:
df2.dtypes

Date                     object
Open                    float64
High                    float64
Low                     float64
Last                    float64
Close                   float64
Total Trade Quantity    float64
Turnover (Lacs)         float64
dtype: object

In [39]:
df2.Date = pd.to_datetime(df2.Date, format='%Y/%m/%d')
df2.dtypes

Date                    datetime64[ns]
Open                           float64
High                           float64
Low                            float64
Last                           float64
Close                          float64
Total Trade Quantity           float64
Turnover (Lacs)                float64
dtype: object

In [12]:
df2.reset_index(level=0, inplace=True)
df2.head()

,index,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,0,2018-08-17,9243.00,9286.50,9130.00,9149.95,9152.10,477538.0,44002.98
1,1,2018-08-16,9124.00,9235.95,9085.00,9202.20,9200.55,465479.0,42757.42
2,2,2018-08-14,9079.00,9158.80,9046.25,9135.00,9132.60,344056.0,31355.62
3,3,2018-08-13,9119.45,9185.00,9012.20,9107.00,9080.85,348201.0,31750.75
4,4,2018-08-10,9150.00,9210.00,9105.00,9119.90,9148.25,427827.0,39190.31

In [13]:
df2[df2['Close']==9152.10]

,index,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,0,2018-08-17,9243.0,9286.5,9130.0,9149.95,9152.1,477538.0,44002.98

In [14]:
df2[df2['Date']=='2018-08-17']

,index,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,0,2018-08-17,9243.0,9286.5,9130.0,9149.95,9152.1,477538.0,44002.98

In [15]:
df2[df2['Date']=='20180817']

,index,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,0,2018-08-17,9243.0,9286.5,9130.0,9149.95,9152.1,477538.0,44002.98

In [32]:
df2.loc[:, ['Date', 'Open']].head()

        Date     Open
0 2018-08-17  9243.00
1 2018-08-16  9124.00
2 2018-08-14  9079.00
3 2018-08-13  9119.45
4 2018-08-10  9150.00

In [65]:
t1 = pd.to_datetime('2003-01-01')
t2 = pd.to_datetime('2003-07-09')
print(t2-t1)

189 days 00:00:00

In [53]:
df2.dtypes

index                            int64
Date                    datetime64[ns]
Open                           float64
High                           float64
Low                            float64
Last                           float64
Close                          float64
Total Trade Quantity           float64
Turnover (Lacs)                float64
dtype: object

In [68]:
df2['Turnover (Lacs)'][(df2['Date'] > t1)].head()

0    44002.98
1    42757.42
2    31355.62
3    31750.75
4    39190.31
Name: Turnover (Lacs), dtype: float64

In [72]:
df2.loc[(df2['Date'] > t1), ['Open', 'Close']].head()

      Open    Close
0  9243.00  9152.10
1  9124.00  9200.55
2  9079.00  9132.60
3  9119.45  9080.85
4  9150.00  9148.25

In [79]:
df2.iloc[0,2]

9243.0

In [82]:
df2.iloc[0:3, 2:5]

     Open     High      Low
0  9243.0  9286.50  9130.00
1  9124.0  9235.95  9085.00
2  9079.0  9158.80  9046.25

In [84]:
df2.iloc[[0, 2, 4], [2, 3]]

     Open    High
0  9243.0  9286.5
2  9079.0  9158.8
4  9150.0  9210.0

In [86]:
df2.iloc[2, 3]

9158.7999999999993

In [88]:
df2[df2 > 0]

,index,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,NaN,2018-08-17,9243.00,9286.50,9130.00,9149.95,9152.10,477538.0,44002.98
1,1.0,2018-08-16,9124.00,9235.95,9085.00,9202.20,9200.55,465479.0,42757.42
2,2.0,2018-08-14,9079.00,9158.80,9046.25,9135.00,9132.60,344056.0,31355.62
3,3.0,2018-08-13,9119.45,9185.00,9012.20,9107.00,9080.85,348201.0,31750.75
4,4.0,2018-08-10,9150.00,9210.00,9105.00,9119.90,9148.25,427827.0,39190.31
5,5.0,2018-08-09,9239.00,9239.00,9060.00,9146.00,9146.05,651728.0,59496.38
6,6.0,2018-08-08,9449.00,9449.00,9183.05,9210.00,9207.40,638498.0,59339.83
7,7.0,2018-08-07,9316.00,9420.00,9271.00,9409.00,9411.50,381993.0,35727.93
8,8.0,2018-08-06,9247.50,9300.00,9200.00,9287.00,9286.40,237693.0,22036.30
9,9.0,2018-08-03,9150.00,9230.00,9150.00,9195.00,9187.00,470958.0,43284.51
10,10.0,2018-08-02,9327.00,9327.00,9120.00,9129.40,9142.40,875157.0,80368.53
11,11.0,2018-08-01,9535.00,9587.75,9300.00,9327.00,9341.60,700719.0,65718.40
12,12.0,2018-07-31,9400.00,9548.85,9355.00,9535.00,9520.55,426388.0,40404.41
13,13.0,2018-07-30,9320.00,9404.50,9233.00,9390.00,9381.90,539464.0,50246.66
14,14.0,2018-07-27,9402.00,9442.20,9290.00,9318.00,9310.40,672141.0,62884.00
15,15.0,2018-07-26,9819.80,9831.70,9361.00,9390.00,9396.25,1261317.0,119952.31
16,16.0,2018-07-25,9853.00,9875.85,9701.00,9769.00,9758.95,384750.0,37593.15
17,17.0,2018-07-24,9778.00,9929.00,9725.00,9842.00,9832.45,749626.0,73845.34
18,18.0,2018-07-23,9448.00,9750.00,9372.00,9703.60,9701.00,607813.0,58246.91
19,19.0,2018-07-20,9392.00,9464.00,9335.00,9400.00,9398.95,272916.0,25687.97
20,20.0,2018-07-19,9408.00,9434.00,9350.00,9392.00,9389.10,199983.0,18792.04
21,21.0,2018-07-18,9482.30,9534.00,9296.90,9371.15,9366.80,430624.0,40586.30
22,22.0,2018-07-17,9351.15,9479.70,9347.00,9439.70,9445.40,457123.0,43029.05
23,23.0,2018-07-16,9429.00,9498.90,9355.00,9383.00,9385.30,216426.0,20392.00
24,24.0,2018-07-13,9408.00,9495.00,9362.25,9399.55,9431.05,511150.0,48209.88
25,25.0,2018-07-12,9448.00,9508.00,9325.25,9355.00,9347.00,336960.0,31753.70
26,26.0,2018-07-11,9529.00,9529.35,9361.00,9390.95,9384.70,328446.0,31017.82
27,27.0,2018-07-10,9380.00,9545.90,9380.00,9540.00,9531.00,485745.0,46048.03
28,28.0,2018-07-09,9395.00,9419.85,9350.00,9368.00,9374.90,331872.0,31142.26
29,29.0,2018-07-06,9315.00,9413.95,9260.00,9310.00,9317.50,508241.0,47562.10
...,...,...,...,...,...,...,...,...,...
3732,3732.0,2003-08-20,217.40,226.45,217.30,226.00,225.00,6049174.0,13487.00
3733,3733.0,2003-08-19,219.85,219.90,215.00,215.30,215.65,3080091.0,6665.77
3734,3734.0,2003-08-18,218.10,221.00,215.40,218.25,216.90,3382031.0,7372.46
3735,3735.0,2003-08-14,223.00,224.40,215.00,217.75,216.55,6298655.0,13879.96
3736,3736.0,2003-08-13,213.00,219.50,212.00,218.50,217.80,7839204.0,16922.52
3737,3737.0,2003-08-12,203.80,212.00,203.50,210.80,210.45,8215213.0,17068.81
3738,3738.0,2003-08-11,198.10,203.80,196.00,201.80,202.20,5651311.0,11399.27
3739,3739.0,2003-08-08,197.00,198.90,196.00,197.50,197.15,2530289.0,4993.93
3740,3740.0,2003-08-07,193.50,196.00,192.25,195.70,195.40,3223676.0,6262.76
3741,3741.0,2003-08-06,191.50,197.50,189.85,191.75,191.60,7451054.0,14414.35
3742,3742.0,2003-08-05,199.00,203.45,192.85,193.85,193.60,9651327.0,19124.34
3743,3743.0,2003-08-04,187.85,198.50,185.00,197.50,197.60,9982429.0,19430.84
3744,3744.0,2003-08-01,182.00,189.00,178.75,188.40,187.15,8027285.0,14798.84
3745,3745.0,2003-07-31,181.70,183.65,179.65,181.00,180.85,3562717.0,6479.36
3746,3746.0,2003-07-30,181.25,184.75,180.10,180.25,181.10,4632246.0,8456.02
3747,3747.0,2003-07-29,179.95,182.90,179.10,180.20,180.30,5229181.0,9460.96
3748,3748.0,2003-07-28,188.00,188.00,175.10,179.25,178.85,5415867.0,9640.85
3749,3749.0,2003-07-25,174.40,175.00,172.10,174.00,173.65,2832967.0,4919.60
3750,3750.0,2003-07-24,175.90,177.00,172.85,173.65,174.10,4305936.0,7511.53
3751,3751.0,2003-07-23,170.50,178.00,169.80,175.55,174.70,13262249.0,23147.59
3752,3752.0,2003-07-22,164.00,169.15,162.10,168.60,167.25,4627992.0,7639.12
3753,3753.0,2003-07-21,169.00,169.40,163.05,164.00,164.90,3315845.0,5526.65
3754,3754.0,2003-07-18,165.00,171.90,160.00,167.40,167.40,5375212.0,9011.90
3755,3755.0,2003-07-17,177.50,178.00,170.65,170.70,172.20,3814181.0,6693.03
3756,3756.0,2003-07-16,176.45,179.10,175.35,176.90,177.10,3759085.0,6675.70
3757,3757.0,2003-07-15,200.00,200.00,173.00,176.30,176.20,6173689.0,10920.01
3758,3758.0,2003-07-14,174.25,179.25,174.25,178.60,177.95,5982324.0,10643.13
3759,3759.0,2003-07-11,167.75,174.85,166.25,173.60,173.35,11740117.0,20246.22
3760,3760.0,2003-07-10,167.00,168.70,164.50,167.00,167.00,10464179.0,17448.20
3761,3761.0,2003-07-09,164.90,170.40,155.00,164.00,164.30,35164283.0,58355.28

In [5]:
df2.head()

,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,2018-08-17,9243.00,9286.50,9130.00,9149.95,9152.10,477538.0,44002.98
1,2018-08-16,9124.00,9235.95,9085.00,9202.20,9200.55,465479.0,42757.42
2,2018-08-14,9079.00,9158.80,9046.25,9135.00,9132.60,344056.0,31355.62
3,2018-08-13,9119.45,9185.00,9012.20,9107.00,9080.85,348201.0,31750.75
4,2018-08-10,9150.00,9210.00,9105.00,9119.90,9148.25,427827.0,39190.31

In [10]:
series1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('2018-08-01', periods=6, freq='M'))
series1

2018-08-31    1
2018-09-30    2
2018-10-31    3
2018-11-30    4
2018-12-31    5
2019-01-31    6
Freq: M, dtype: int64

In [11]:
df2.at[3, 'Open'] = 0
df2.head()

,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,2018-08-17,9243.0,9286.50,9130.00,9149.95,9152.10,477538.0,44002.98
1,2018-08-16,9124.0,9235.95,9085.00,9202.20,9200.55,465479.0,42757.42
2,2018-08-14,9079.0,9158.80,9046.25,9135.00,9132.60,344056.0,31355.62
3,2018-08-13,0.0,9185.00,9012.20,9107.00,9080.85,348201.0,31750.75
4,2018-08-10,9150.0,9210.00,9105.00,9119.90,9148.25,427827.0,39190.31

In [14]:
df2.at[df2.Date=='2018-08-14','Open'] = 0
df2.head()

,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,2018-08-17,9243.0,9286.50,9130.00,9149.95,9152.10,477538.0,44002.98
1,2018-08-16,9124.0,9235.95,9085.00,9202.20,9200.55,465479.0,42757.42
2,2018-08-14,0.0,9158.80,9046.25,9135.00,9132.60,344056.0,31355.62
3,2018-08-13,0.0,9185.00,9012.20,9107.00,9080.85,348201.0,31750.75
4,2018-08-10,9150.0,9210.00,9105.00,9119.90,9148.25,427827.0,39190.31

In [19]:
df2.iat[2,4] = 0
df2.iat[3,4] = 0
df2.head()

,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,2018-08-17,9243.0,9286.50,9130.00,9149.95,9152.10,477538.0,44002.98
1,2018-08-16,9124.0,9235.95,9085.00,9202.20,9200.55,465479.0,42757.42
2,2018-08-14,0.0,9158.80,9046.25,0.00,9132.60,344056.0,31355.62
3,2018-08-13,0.0,9185.00,9012.20,0.00,9080.85,348201.0,31750.75
4,2018-08-10,9150.0,9210.00,9105.00,9119.90,9148.25,427827.0,39190.31

In [3]:
df2.mean().head()

Open     2238.304864
High     2263.911071
Low      2211.198724
Last     2237.051621
Close    2237.169710
dtype: float64

In [ ]:
%matplotlib inline
from matplotlib import pyplot as plt
plt.plot(df2.High, df2.Date)

In [5]:
df2.mean(1).head()

0    81071.790000
1    79154.874286
2    60137.610000
3    60779.464286
4    73250.065714
dtype: float64

In [4]:
df3 = df2.copy()
df3.drop(labels=df2.columns[1:], axis = 1, inplace = True)

In [5]:
import numpy as np
df3['Vehicles Sold (Thousands)'] = pd.Series((10 * np.random.random_sample(len(df3['Date']))))
df3['Vehicles Sold (Thousands)'] = round(df3['Vehicles Sold (Thousands)'],3)
df3.head()
df3.head()

         Date  Vehicles Sold (Thousands)
0  2018-08-17                      9.139
1  2018-08-16                      4.378
2  2018-08-14                      8.805
3  2018-08-13                      4.111
4  2018-08-10                      0.996

In [6]:
df3['Vehicles Sold (Thousands)'].describe()

count    3762.000000
mean        4.947931
std         2.882000
min         0.006000
25%         2.464000
50%         4.856500
75%         7.400500
max         9.998000
Name: Vehicles Sold (Thousands), dtype: float64

In [7]:
pd.merge(df2, df3, on='Date').head()

,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs),Vehicles Sold (Thousands)
0,2018-08-17,9243.00,9286.50,9130.00,9149.95,9152.10,477538.0,44002.98,9.139
1,2018-08-16,9124.00,9235.95,9085.00,9202.20,9200.55,465479.0,42757.42,4.378
2,2018-08-14,9079.00,9158.80,9046.25,9135.00,9132.60,344056.0,31355.62,8.805
3,2018-08-13,9119.45,9185.00,9012.20,9107.00,9080.85,348201.0,31750.75,4.111
4,2018-08-10,9150.00,9210.00,9105.00,9119.90,9148.25,427827.0,39190.31,0.996

In [12]:
df2.groupby('Close').sum().head()

         Open    High     Low   Last  Total Trade Quantity  Turnover (Lacs)
Close
164.30  164.9  170.40  155.00  164.0            35164283.0         58355.28
164.90  169.0  169.40  163.05  164.0             3315845.0          5526.65
167.00  167.0  168.70  164.50  167.0            10464179.0         17448.20
167.25  164.0  169.15  162.10  168.6             4627992.0          7639.12
167.40  165.0  171.90  160.00  167.4             5375212.0          9011.90

In [13]:
df2['Turnover (Lacs)'].describe()

count      3762.000000
mean      15263.560869
std       17206.721843
min         213.150000
25%        5742.352500
50%        9249.970000
75%       19330.517500
max      487899.240000
Name: Turnover (Lacs), dtype: float64

In [14]:
df2[df2['Turnover (Lacs)'] < 300]

,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
2301,2009-05-18,924.0,954.0,918.0,954.00,938.20,22796.0,213.15
2429,2008-10-28,536.0,567.0,536.0,552.65,547.15,47863.0,260.61

In [19]:
df2[df2['Turnover (Lacs)'] > 200000]

,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
675,2015-11-30,4586.0,4700.0,4492.1,4555.0,4606.9,10567769.0,487899.24

In [43]:
from matplotlib import pyplot as plt
plt.plot(df2.Close.resample('Y', on = 'Date'), 
         df2.Date.resample('Y', on = 'Date'))

KeyError: 'The grouper name Date is not found'